waterHammer/domain/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    walls
    {
        //type            slip;
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    vane
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    /*inlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }*/
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;   //calculated;
        //value           $internalField;
    }

    "(sides|oversetPatch)"
    {
        type            overset;
    }
}

// ************************************************************************* //
