waterHammer/domain/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  11                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    "(walls|vane)"
    {
        type            zeroGradient;
    }

//    inlet
//    {
//        type            uniformTotalPressure;
//        pressure        table
//        (
//            (0 10)
//            (1 40)
//        );
//        p0              40; // only used for restarts
//        U               U;
//        phi             phi;
//        rho             none;
//        psi             none;
//        gamma           1;
//        value           uniform 40;
//    }
    inlet
    {
        type            zeroGradient;
    }
    /*inlet
    {
        type            totalPressure;
	rho             none;
    	p0              uniform 200;
    	value           uniform 200;
    }*/
    outlet
    {
        type            fixedValue;   //calculated;
        value           $internalField;
    }

    oversetPatch
    {
        type            overset;
    }
    sides
    {
        type       	overset;
        //type            fixedFluxPressure;
    }
}

// ************************************************************************* //
